/*
 * =====================================================================================
 *
 *       Filename:  20201029-190-reverseBits.c
 *
 *    Description:  
 *
 *        Version:  1.0
 *        Created:  2020/10/31 13时43分41秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  YOUR NAME (), 
 *   Organization:  
 *
 * =====================================================================================
 */
#include <stdlib.h>
uint32_t reverseBits(uint32_t n) {
    /*
    步骤实现该算法：
    首先，我们将原来的 32 位分为 2 个 16 位的块。
    然后我们将 16 位块分成 2 个 8 位的块。
    然后我们继续将这些块分成更小的块，直到达到 1 位的块。
    在上述每个步骤中，我们将中间结果合并为一个整数，作为下一步的输入。
           b1b0
         10/  \01
        b1 0   0 b0
        0  b1  b0 0
            b1b0
    */
    n = (n >> 16) | (n << 16);
    n = ((n & 0xff00ff00) >> 8) | ((n & 0x00ff00ff) << 8);
    n = ((n & 0xf0f0f0f0) >> 4) | ((n & 0x0f0f0f0f) << 4);
    n = ((n & 0xcccccccc) >> 2) | ((n & 0x33333333) << 2);
    n = ((n & 0xaaaaaaaa) >> 1) | ((n & 0x55555555) << 1);
    return n;
}
